<?php 
1、当你踏进入社会的那一刻起，请为自己今后的一言一行，负责任！做任何事情都需要三思而后行。

2、作为IT技术员的我们，可能一直在寻找一家好的公司，希望有一个大牛会主动来带领自己进步和提升，但你不要忘记假如地球上只剩下你一个人的时候，你是否就会选择死亡，是的话你将不适合生活在这个社会。

3、但你身边有技术不错的朋友或熟悉的朋友，而恰巧你公司又在招聘相应的岗位时，你需要先警醒自己，谁都不敢妄称自己能够看清身边的任何一个人，你又如何能够保证，你内推的人，一定会是一个优秀的基层员工；一经内推，你将负起监管责任，一旦发生事故，将会严重影响你自己的事业。

4、人生成功的路上，是一个不停分享的过程，成功的人生是无法复制的，每个人都有自己的人生，所以你无须担心自己的技术会被人复制，自己的策划会被复制，不过记得一句话，人总是要给自己留条后路，否则你将是下一个项羽。

5、在工作中，当你觉得自己还年轻时，其实你已经老了！因为，在同龄人中，你的优势已经在加速老去，直到哪天你承认自己已经老的时候，你已经死了！

6、有可能你并不是一个大学生，又或者在你同一届的同学中，你是比较早出社会打拼的；你要清晰的认识到，公司再大也只不过是一个井，就算让你爬到顶层，也改变不了你是一个井底之蛙的事实，然而等你的同学们出来之后，你还是一如既往的为人打拼，那么你们之间的差距真的只有毫厘之分。若是你爬出了这个井，成为了掘井人，那才是真正能够改变同辈之间差距的唯一道路。